INSERT INTO defaultdb.activities (activityId,title,description,imageUrl,status,createdAt) VALUES
	 ('ACT1756717423151','สำนักดาบพิฆาตอสูร','ให้ทุกท่านค้นหาอันตรายในภาพ และระบุว่าอันตรายที่อาจเกิดขึ้นคืออะไรมีวิธีการดำเนินการป้องกันและแก้ไขอย่างไร[no-image]','https://res.cloudinary.com/ddvmr1z07/image/upload/v1762480062/safety-spot/wfcwlwpirzkjboursurk.jpg','active','2025-09-01 16:03:43'),
	 ('ACT1756807875584','เขตก่อสร้างอาคาร สตง.','คำชี้แจง
1. ให้ผู้เข้าร่วมสังเกตพื้นที่ก่อสร้างและค้นหาว่ามีอันตรายตรงจุดใดบ้าง
2. ระบุจำนวนจุดที่พบอันตรายทั้งหมด
3. อธิบายว่าอันตรายที่อาจเกิดขึ้นคืออะไร และจะส่งผลกระทบอย่างไร
4. เสนอแนวทางป้องกันและแนวทางแก้ไขที่เหมาะสม
หมายเหตุ : ห้ามคัดลอกคำตอบของผู้อื่น ให้คิด วิเคราะห์ และเขียนจากความเข้าใจของตนเอง[no-image]','https://res.cloudinary.com/ddvmr1z07/image/upload/v1757917935/safety-spot/h7ssblwllr3vagtnxcgp.jpg','active','2025-09-02 17:11:15'),
	 ('ACT5032d2d9-adbe-4abf-8fbc-6f16b3f9786d','ฉงชิ่งแดนมังกร','🏗️ คำชี้แจง
1. ให้ผู้เข้าร่วมสังเกตพื้นที่ตลาดในภาพ แล้วระบุจุดที่มีความเสี่ยงหรืออันตรายที่มองเห็นได้จากภาพนั้น
2. นับจำนวนจุดอันตรายทั้งหมด ที่สามารถระบุได้ชัดเจน
3. อธิบายลักษณะของอันตรายแต่ละจุดว่าอาจเกิดเหตุการณ์อะไรขึ้นได้ และจะส่งผลกระทบต่อผู้ปฏิบัติงานหรือทรัพย์สินอย่างไร
4. เสนอแนวทางป้องกันและแนวทางแก้ไข ที่เหมาะสมและสามารถปฏิบัติได้จริง เพื่อขจัดหรือลดความเสี่ยงจากอันตรายนั้น
5. ให้ตอบเฉพาะจุดที่ปรากฏในภาพเท่านั้น จุดที่มองไม่เห็นหรือคาดเดาไม่ได้จากภาพจะไม่ได้รับคะแนน

📌 หมายเหตุ:
ห้ามคัดลอกคำตอบของผู้อื่น
ให้ใช้การสังเกต วิเคราะห์ และให้เหตุผลจากความเข้าใจของตนเอง
การอธิบายชัดเจนและมีเหตุผลครบทั้ง “สาเหตุ – ผลกระทบ – แนวทางป้องกัน” จะได้รับคะแนนเต็ม[no-image]','https://res.cloudinary.com/ddvmr1z07/image/upload/v1762504050/safety-spot/aouxp3seok2unriwepzk.jpg','active','2025-11-07 08:27:31'),
	 ('ACTb558e1c4-242e-456d-a590-4cdd559f9f8b','สะพานข้ามแม่น้ำแคว','🏗️ คำชี้แจง
1. ให้ผู้เข้าร่วมสังเกตพื้นที่ตลาดในภาพ แล้วระบุจุดที่มีความเสี่ยงหรืออันตรายที่มองเห็นได้จากภาพนั้น
2. นับจำนวนจุดอันตรายทั้งหมด ที่สามารถระบุได้ชัดเจน
3. อธิบายลักษณะของอันตรายแต่ละจุดว่าอาจเกิดเหตุการณ์อะไรขึ้นได้ และจะส่งผลกระทบต่อผู้ปฏิบัติงานหรือทรัพย์สินอย่างไร
4. เสนอแนวทางป้องกันและแนวทางแก้ไข ที่เหมาะสมและสามารถปฏิบัติได้จริง เพื่อขจัดหรือลดความเสี่ยงจากอันตรายนั้น
5. ให้ตอบเฉพาะจุดที่ปรากฏในภาพเท่านั้น จุดที่มองไม่เห็นหรือคาดเดาไม่ได้จากภาพจะไม่ได้รับคะแนน

📌 หมายเหตุ:
ห้ามคัดลอกคำตอบของผู้อื่น
ให้ใช้การสังเกต วิเคราะห์ และให้เหตุผลจากความเข้าใจของตนเอง
การอธิบายชัดเจนและมีเหตุผลครบทั้ง “สาเหตุ – ผลกระทบ – แนวทางป้องกัน” จะได้รับคะแนนเต็ม[no-image]','https://pub-0251fc2000074314bc1c224ceeddf191.r2.dev/safety-spot/1762763883558-522164a8-dab2-4e15-bcc1-e66dba3b945a.jpg','inactive','2025-11-10 08:38:05'),
	 ('ACTbb07d3a5-4c42-48ae-8cd9-b1d14dddeb3f','ลดโลกร้อนง่ายๆ ด้วยตัวคุณ','🪴 วิธีเข้าร่วมกิจกรรม “ลดโลกร้อน ทำได้ทุกวัน”
1. เพียงแค่คุณเข้าร่วมกิจกรรมกับเราใน Safety Spot
2. บอกเราว่าในชีวิตการทำงาน คุณทำอะไรบ้างในการช่วยลดโลกร้อน 🌏
3. แนบรูปภาพที่แสดงให้เห็นว่าคุณ “ทำจริง ช่วยจริง” 📸
4. ทำครบ 2 ขั้นตอน รับ 100 คะแนน ทุกคนที่เข้าร่วม 🎯
5. ผู้โชคดี 5 คน รับ แก้วบาร์บี้ลิขสิทธิ์แท้จากเรา! 💖','https://res.cloudinary.com/ddvmr1z07/image/upload/v1761013427/safety-spot/glj7zn1sk5tjemael6pc.png','inactive','2025-10-21 02:23:49'),
	 ('ACTffa39349-4306-4433-8ade-d6f9fb88d96f','ต.ตลาดขาดรัก','🏗️ คำชี้แจง
1. ให้ผู้เข้าร่วมสังเกตพื้นที่ตลาดในภาพ แล้วระบุจุดที่มีความเสี่ยงหรืออันตรายที่มองเห็นได้จากภาพนั้น
2. นับจำนวนจุดอันตรายทั้งหมด ที่สามารถระบุได้ชัดเจน
3. อธิบายลักษณะของอันตรายแต่ละจุดว่าอาจเกิดเหตุการณ์อะไรขึ้นได้ และจะส่งผลกระทบต่อผู้ปฏิบัติงานหรือทรัพย์สินอย่างไร
4. เสนอแนวทางป้องกันและแนวทางแก้ไข ที่เหมาะสมและสามารถปฏิบัติได้จริง เพื่อขจัดหรือลดความเสี่ยงจากอันตรายนั้น
5. ให้ตอบเฉพาะจุดที่ปรากฏในภาพเท่านั้น จุดที่มองไม่เห็นหรือคาดเดาไม่ได้จากภาพจะไม่ได้รับคะแนน

📌 หมายเหตุ:
ห้ามคัดลอกคำตอบของผู้อื่น
ให้ใช้การสังเกต วิเคราะห์ และให้เหตุผลจากความเข้าใจของตนเอง
การอธิบายชัดเจนและมีเหตุผลครบทั้ง “สาเหตุ – ผลกระทบ – แนวทางป้องกัน” จะได้รับคะแนนเต็ม[no-image]','https://res.cloudinary.com/ddvmr1z07/image/upload/v1759818227/safety-spot/qulvvn1w3cug4qylypki.jpg','active','2025-09-04 16:13:29');
