INSERT INTO public.submissions ("submissionId","activityId","lineUserId",description,"imageUrl",status,points,"createdAt") VALUES
	 ('SUBd52ed043-75ab-4ee8-af04-a07b38a383e6','ACT1756717423151','U5ed5f1ea35304e72d2785df3c705470a','ยกตู้เซฟโดยไม่มีอุปกรณ์ช่วย
จุดเสี่ยงคืออาจจะร่วงทับเท้าหรือยกผิดท่าทำให้ปวดหลังได้','https://res.cloudinary.com/ddvmr1z07/image/upload/v1757062167/safety-spot/ok9ccn2gdz6tywnkw6um.jpg','approved',1,'2025-09-05 15:49:28.701+07'),
	 ('SUB563178f8-83d9-417f-a9c0-099ccf2d0430','ACT1756717423151','Udb19859a3e2b7f89c448b9f60b5bfe24','ยกตู้เซฟโดยไม่ใช้อุปกรณ์เซฟตี้ในการยก
จุดเสี่ยงทำให้ได้รับบาดเจ็บถ้าตู้ร่วงลงมาทับเท้าหรืออาจยกผิดท่าทำให้ปวดหลังได้','https://res.cloudinary.com/ddvmr1z07/image/upload/v1757062472/safety-spot/np5wfikll6x2cplervvx.jpg','approved',1,'2025-09-05 15:54:34.356+07'),
	 ('SUB689abf86-db2e-4380-ab7c-812271c3d7c8','ACT1756717423151','Udb19859a3e2b7f89c448b9f60b5bfe24','ไม่สวมใส่ถุงมือขณะปฏิบัติงาน
จุดเสี่ยงอาจเกิดสะเก็ดไฟกระเด็นใส่มือได้รับบาดเจ็บ','https://res.cloudinary.com/ddvmr1z07/image/upload/v1757062657/safety-spot/oktqjpef3fsftuzz0hfo.jpg','approved',1,'2025-09-05 15:57:38.831+07'),
	 ('SUBf557c785-fe55-4346-a1b4-424e8c4dd285','ACT1756717423151','U5ed5f1ea35304e72d2785df3c705470a','หน้าต่างปิดไม่สนิททำให้ฝนสาดแต่คนที่ขึ้นไปปิดหน้าต่างไม่ได้ใช้บันไดในการขึ้นไปปิดหน้าต่าง
จุดเสี่ยงอาจทำให้กล่องล้มได้รับบาดเจ็บได้','https://res.cloudinary.com/ddvmr1z07/image/upload/v1757062887/safety-spot/r1vveyseyz3oy1dyd2et.jpg','approved',1,'2025-09-05 16:01:28.707+07'),
	 ('SUB01a08bfa-ac7d-4402-b8e1-09607ea83543','ACT1756717423151','U501da046355458a7429f8ab0c1e8462a','ใช้เครื่องจักรโดยไม่มีอุปกรเชฟตี้ไม่ใส่ถุงมือในขณะปฏิบัติงาน','https://res.cloudinary.com/ddvmr1z07/image/upload/v1757062940/safety-spot/ghize7g4qc3orenl6eec.jpg','approved',1,'2025-09-05 16:02:21.285+07'),
	 ('SUB5c88a92e-d062-40d3-ba1b-fe124e26e9d4','ACT1756717423151','U5ed5f1ea35304e72d2785df3c705470a','ย้ายตู้โดยไม่ใช้อุปกรณ์ในการช่วยยกตู้
จุดเสี่ยงอาจโดนตู้ล้มทับได้','https://res.cloudinary.com/ddvmr1z07/image/upload/v1757063034/safety-spot/hgxiwjdnvd7lj5qsfgpb.jpg','approved',1,'2025-09-05 16:03:55.372+07'),
	 ('SUB3ddb3374-ed77-45d0-8386-10980b9b5a18','ACT1756717423151','U253d59f848bd8df38efa1471f80e6702','1.ใช้เครื่องมือหรืออุปกรณ์ไม่เหมาะสมกับลักษณะงาน
2.ไม่สวมอุปกรณ์ PPE ในในขณะปฏิบัติงาน','https://res.cloudinary.com/ddvmr1z07/image/upload/v1757066060/safety-spot/a8aiingciaaqrjf2iwcz.jpg','approved',2,'2025-09-05 16:54:22.162+07'),
	 ('SUB634e699d-da1b-4fe8-9d84-67cf8b8fd16c','ACT1756717423151','U20e38085f09aca2811cce54cb266d603','1. ปีนกล่องแทนบันได	ใช้บันไดมาตรฐาน
2. กล่องไม่มั่นคง	ห้ามใช้กล่องเป็นฐานปีน
3. ไม่มีคนช่วยประคอง	ให้มีเพื่อนช่วยจับบันได
4. เช็ดกระจกบนที่สูง	สวมสายรัดนิรภัย/เข็มขัดเซฟตี้
5. น้ำมันหกบนพื้น	ทำความสะอาดทันที
6. ไม่มีป้ายเตือนพื้นลื่น	วางป้าย “ระวังลื่น”
7. เดินบนพื้นเปียก	ใส่รองเท้าเซฟตี้กันลื่น
8. ถังน้ำมันล้ม	เก็บถังในชั้นวาง/ยึดให้นิ่ง
9. ถังไม่มีฝาปิด	ใช้ถังที่มีฝาปิดแน่นหนา
10. ดันของหนักผ่านพื้นที่เปียก	ห้ามเคลื่อนย้ายของขณะพื้นลื่น
11. คนแบกตู้เซฟหนัก	ใช้รถเข็น/รถยกแทน
12. ยกของผิดท่า	ฝึกวิธียกของถูกต้อง (ย่อตัว ใช้แรงขา)
13. กล่องซ้อนสูงเกินไป	ซ้อนไม่เกินระดับอก
14. กล่องไม่มั่นคง	จัดเรียงสลับฟันปลา
15. ไม่มีที่กั้นรอบกองกล่อง	ใช้เชือก/รั้วกั้น
16. คนยืนใกล้กองกล่องสูง	ห้ามยืนใต้หรือใกล้ของสูงที่ไม่มั่นคง
17. หลุมเปิดไว้	ปิดด้วยฝาที่แข็งแรง
18. ไม่มีป้ายเตือนหลุม	ติดป้าย “ระวังตกหลุม”
19. ไม่มีรั้วกั้นรอบหลุม	ใช้แถบกั้นรอบพื้นที่
20. คนในหลุมไม่ใส่หมวก	สวมหมวกเซฟตี้
21. ไม่มีคนเฝ้าปากหลุม	จัดผู้เฝ้าระวัง
22. เครื่องมือวางรอบหลุม	เก็บเครื่องมือในกล่อง
23. คนตอกตะปูไม่ใส่ถุงมือ	ใส่ถุงมือกันบาด
24. ใช้มือจับตะปูโดยตรง	ใช้คีมจับตะปู
25. ตอกใกล้ขอบไม้	เลื่อนตำแหน่งตะปูเข้าด้านใน
26. ไม่ใส่แว่นตาขณะตอก	ใส่แว่นตานิรภัย
27. เครื่องจักรไม่มีที่ครอบ	ติดตั้งที่ครอบป้องกัน
28. ผู้ปฏิบัติงานไม่ใส่แว่นตา	ต้องใส่แว่นตาเซฟตี้
29. ผมยาวไม่มัดเข้าเครื่อง	มัดผม/ใส่หมวกคลุม
30. ไม่มีปุ่มหยุดฉุกเฉินชัดเจน	ติดตั้งปุ่ม E-Stop ใกล้มือ','https://res.cloudinary.com/ddvmr1z07/image/upload/v1757063742/safety-spot/mm1rpvrljlsfppi9er9o.jpg','approved',11,'2025-09-05 16:15:43.534+07'),
	 ('SUB62f924c3-77ef-4570-99f6-438681262688','ACT1756717423151','Udb19859a3e2b7f89c448b9f60b5bfe24','น้ำมันหกที่พื้น
จุดเสี่ยงคือ อาจเกิดอันตรายขณะเดินลื่นล้ม
ทำให้ได้รับบาทเจ็บที่ที่แขนและขาหรือทุกส่วนของร่างกายได้','https://res.cloudinary.com/ddvmr1z07/image/upload/v1757062956/safety-spot/tgatfwsyobptv7ka7tfe.jpg','approved',1,'2025-09-05 16:02:55.457+07'),
	 ('SUBf508fa1f-f568-443f-a442-f3732b88b4ac','ACT1756717423151','Udd3dd6ba767a06c794be9d6c8e4a3db2','ยกของไม่ถูกต้อง
1.ท่ายกต้องอยู่ระหว่างอกห้ามเลยระดับสายตาอาจทำให้บังทำให้มองไม่เห็นเวลาเดินอาจทำให้เกิดอุบัติเหตุได้
2.ต้องสวมถุงมือทุกครั้งขณะปฏิบัติงาน
3.หากกรณียกของหนักเกินต้องใส่สายรัดเอวบล็อคหลัง','https://res.cloudinary.com/ddvmr1z07/image/upload/v1757063299/safety-spot/jzocgzhdbcxam2jwvw9k.jpg','approved',3,'2025-09-05 16:08:20.286+07');
INSERT INTO public.submissions ("submissionId","activityId","lineUserId",description,"imageUrl",status,points,"createdAt") VALUES
	 ('SUBc9c4ab42-e8c2-4369-955b-9546878c4d31','ACT1756717423151','U1dcbe8e3c66acf2dc1c530a03918a010','***ไม่มีอุปกรณ์ Safety ป้องกันอันตราย
1.หน้ากาก
2.ถุงมือ
3.ต้องมีกร์าด','https://res.cloudinary.com/ddvmr1z07/image/upload/v1757063311/safety-spot/uj0ualnpbmjut5l1tedz.jpg','approved',1,'2025-09-05 16:08:32.9+07'),
	 ('SUBbe1575b4-673b-4fad-b01c-2c81764e5d20','ACT1756717423151','U463d6c75321700740b8093575d6aaaf3','หน้าต่างฝนสาดคนปิดหน้าต่างยืนบนกล่องที่ไม่มั่นคงอาจจะทำให้หล่นได่ได้รับบาดเจ็บ ควรยืนบนวัสดุที่แข็งแรงมั่นคง',NULL,'approved',1,'2025-09-05 15:37:49.754+07'),
	 ('SUB4c936563-34e2-4612-b76c-a92da1562895','ACT1756717423151','U3f08e5c27ff57004358e74657c179dfb','1. ปีนกล่องแทนบันได  
วิธีป้องกัน ใช้บันไดมาตรฐานแทน
2. กล่องไม่มั่นคง
 วิธีป้องกัน ยึดกล่องหรือห้ามใช้เป็นที่ปีน
3. ไม่มีคนช่วยประคอง 
วิธีป้องกัน ให้มีผู้ช่วยยืนจับบันได/กล่อง
4. พื้นมีน้ำมันหก 
วิธีป้องกัน เช็ดทำความสะอาดทันที
5. ไม่มีรองเท้าเซฟตี้กันลื่น 
วิธีป้องกัน ใส่รองเท้าพื้นกันลื่น
6. ถังน้ำมันล้ม 
วิธีป้องกัน เก็บถังในชั้นวางหรือที่ล็อกกันกลิ้ง
7. ไม่มีฝาปิดถัง
 วิธีป้องกัน ใช้ถังที่มีฝาปิดแน่นหนา
8. แบกของหนักเกินไป
 วิธีป้องกัน ใช้เครื่องทุ่นแรง เช่น รถเข็น รถยก
9. ยกของผิดท่า
วิธีป้องกัน  ฝึกยกของถูกวิธี (ย่อตัว ใช้แรงขา)
10. ไม่มีเครื่องช่วยยก 
 วิธีป้องกัน จัดเตรียมอุปกรณ์ยกที่เหมาะสม
11. กล่องซ้อนสูงเกินไป
 วิธีป้องกัน  ซ้อนกล่องไม่เกินมาตรฐาน (สูงไม่เกินอก)
12. กล่องไม่ได้จัดเรียงให้มั่นคง  
วิธีป้องกันจัดเรียงเรียงแบบสลับฟันปลา
13. ไม่มีเชือกกั้น/ที่กั้นพื้นที่ซ้อนกล่อง 
 วิธีป้องกัน ติดตั้งที่กั้นป้องกันของล้ม
14. เครื่องมือวางเกลื่อนพื้น 
 วิธีป้องกันเ ก็บเครื่องมือเข้ากล่อง/ตู้เก็บ
15. เสี่ยงสะดุดเครื่องมือบนพื้น 
วิธีป้องกันกำหนดจุดวางเครื่องมือให้ชัด
16. พื้นเปิดหลุมไม่มีฝาปิด 
วิธีป้องกัน ทำฝาปิดแข็งแรงตลอดเวลา
17. ไม่มีป้ายเตือนหลุม 
วิธีป้องกัน ติดป้าย/แถบกั้นเตือนอันตราย
18. คนในหลุมไม่สวมหมวกนิรภัย 
วิธีป้องกัน บังคับใส่หมวกเซฟตี้
19. ไม่มีคนเฝ้าปากหลุม 
วิธีป้องกัน จัดให้มีผู้ดูแล/เฝ้า
20. เครื่องจักรกลึงไม่มีที่ครอบ 
วิธีป้องกัน ติดตั้งที่ครอบป้องกันชิ้นงานกระเด็น
21. ไม่ใส่แว่นตานิรภัย 
วิธีป้องกัน ใส่แว่นตาเซฟตี้ทุกครั้งที่ทำงาน
22. ผมยาวไม่มัด 
วิธีป้องกันมัดผมเก็บหรือใส่หมวกคลุมผม
23. ไม่มีปุ่มหยุดฉุกเฉินชัดเจน 
วิธีป้องกัน ติดตั้งปุ่มหยุดฉุกเฉินในจุดที่มองเห็นง่าย
24. ตอกตะปูโดยไม่ใส่ถุงมือ 
วิธีป้องกันสวมถุงมือกันบาด
25. ตอกตะปูใกล้ขอบไม้ 
วิธีป้องกัน เลื่อนตำแหน่งตะปูเข้าด้านใน
26. ใช้มือจับตะปูโดยตรง 
วิธีป้องกัน ใช้คีมจับหรือตัวช่วยจับตะปู
27. คนยืนใต้ของหนักที่อาจล้มทับ 
วิธีป้องกันห้ามยืนในแนวทางของของหนัก
28. ไม่มีการจัดเก็บพื้นที่ทำงาน 
วิธีป้องกัน จัดทำ 5ส. (สะสาง สะดวก สะอาด สร้างมาตรฐาน สร้างวินัย)
29. ไม่มี PPE ครบชุด (หมวก, ถุงมือ, รองเท้า) วิธีป้องกัน บังคับใส่ PPE ตามมาตรฐาน
30. ไม่มีการแบ่งโซนพื้นที่ทำงาน/จัดเก็บ
 วิธีป้องกันกำหนดโซนทำงานและทางเดินชัดเจน','https://res.cloudinary.com/ddvmr1z07/image/upload/v1757062392/safety-spot/hxoutjtpqayy2mlfyroy.jpg','approved',11,'2025-09-05 15:53:13.448+07'),
	 ('SUBc420556c-676e-41ae-9d0a-ae5d69053296','ACT1756717423151','U463d6c75321700740b8093575d6aaaf3','1.ยืนปิดหน้าต่างบนกล่องไม่ปลอดภัย
2.ชายยืนข้างหน้าต่างมีคราบน้ำลื่นล้ม
3.ผู้ชายที่ยืนทำงานไม่มีอุปกรณ์ป้องกัน
4.บันไดวางบนพื้น
5.ผู้ชายเคลือ่นย้ายกล่องไม่ถูกวิธีอาจเกิดอุบัติเหตุ
6.ชายที่ลงไปปฎิบัติงานด้านล่างไม่มีป้ายแจ้งเตือนอาจเกิดอันตราย
7.มีเด็กเข้ามาในจุดปฏิบัติงาน
8.ถังน้ำหกเปื้อนพื้น
9.ชายทำงานบนฌต๊ะวางกล่องไม่เหมาะสม
10.ชายยกกล่องเทินกันสูงเกินไปอันตราย
11.ชายยกกล่องไม่ถูกวิธีอาจโดนเครือ่งมือที่กีดขวางด้านบนเป็นเหล็กตะขอ
12.ไม้หรือค้อนวางบนพื้น
13.ชายยกลากตู้นิรภัยไม่ถูกหลักการยศาสต์อาจได้รับบาดเจ็บ
14.ผู้หญิงที่ทำงานประมาทไม่สวมถุงมือป้องกัน
15.ชายที่เข็นตู้อาจหล่นทับชายที่ทำงานในช่องด้านล่สงที่เปิดไว้','https://res.cloudinary.com/ddvmr1z07/image/upload/v1757062562/safety-spot/tmgxcxpe6ib6vsmd8teh.jpg','approved',0,'2025-09-05 15:56:03.505+07'),
	 ('SUB9ed61d50-54cb-4f4e-8544-03c7d5466315','ACT1756717423151','U1f1f6570c3ac9df4a96572184a0adcc2','เหยียบกล่องปิดหน้าต่างอาจทำให้เกิดอันตราย
ย้ายตู้ไม่มีอุปกรณ์ช่วยอาจทำให้ตู้ล้มทับได้
น้ำหกยืนบนพื้นเปียกอาจทำให่ลื่นล้มได้รับอัตรายทำงานไม่สวมอุปกรณ์','https://res.cloudinary.com/ddvmr1z07/image/upload/v1757066490/safety-spot/lh6sl9c9awa6hswycpcd.jpg','approved',1,'2025-09-05 17:01:30.873+07'),
	 ('SUB33a2c4b1-d6a5-427d-8b89-1b23087966ca','ACT1756717423151','U26dc7ee55dde44e859ab6a4ea32d0194','ทำงานไม่ถูกวิธีไม่มีอุปกรณ์ peไม่ใช่บันไดยกของผิดวิธีสรุปอันตรายทั้งหมด','https://res.cloudinary.com/ddvmr1z07/image/upload/v1757066783/safety-spot/uvujazetvqhneueivece.jpg','approved',1,'2025-09-05 17:06:24.395+07'),
	 ('SUB539e4664-e4dd-4eee-8f03-cc8d0271bf52','ACT1756717423151','U320e199e13b623206fdd29c333c6ed63','มุมซ้ายบน (คนเช็ดกระจก)

1. ปีนกล่องแทนบันได วิธีป้องกัน ใช้บันไดมาตรฐาน
2. กล่องไม่มั่นคง  วิธีป้องกัน ห้ามใช้กล่องเป็นฐานปีน
3. ไม่มีคนช่วยประคอง  วิธีป้องกัน ให้เพื่อนช่วยจับบันได
4. เช็ดกระจกใกล้ขอบหน้าต่าง  วิธีป้องกัน สวมสายรัดนิรภัยถ้าต้องทำงานสูง

พื้นที่น้ำมันหก (กลางภาพ)

5. น้ำมันหกบนพื้น  วิธีป้องกัน ทำความสะอาดทันที
6. ไม่มีป้ายเตือนพื้นลื่น  วิธีป้องกัน วางป้ายเตือน
7. คนเดินบนพื้นเปียก  วิธีป้องกัน ใส่รองเท้าพื้นกันลื่น
8. ถังน้ำมันล้ม  วิธีป้องกัน เก็บถังในชั้นวาง/ยึดให้มั่นคง
9. ถังไม่มีฝาปิด  วิธีป้องกัน ใช้ถังที่มีฝาปิดแน่นหนา
10. คนกำลังดันของหนักผ่านพื้นที่เปียก  วิธีป้องกัน ห้ามเคลื่อนย้ายของขณะพื้นลื่น
ของหนักและกล่อง (ด้านบนและกลางขวา)
11. คนแบกตู้เซฟ  วิธีป้องกัน ใช้รถเข็นหรือรถยกแทน
12. แบกผิดท่ายก  วิธีป้องกัน ฝึกวิธีการยกที่ถูกต้อง
13. กล่องซ้อนสูงเกินไป  วิธีป้องกัน ซ้อนกล่องไม่เกินอก
14. กล่องไม่มั่นคง  วิธีป้องกัน จัดเรียงแบบฟันปลา
15. ไม่มีที่กั้นรอบกองกล่อง  วิธีป้องกัน ติดเชือก/แถบกั้น
16. คนยืนใกล้กองกล่องสูง  วิธีป้องกัน ห้ามยืนใกล้ของสูงที่ไม่มั่นคง

หลุมพื้น (กลางล่าง)

17. พื้นเปิดหลุมไว้  วิธีป้องกัน ต้องปิดด้วยฝาที่แข็งแรง
18. ไม่มีป้ายเตือน  วิธีป้องกัน ติดป้าย “ระวังหลุม”
19. ไม่มีรั้วกั้น  วิธีป้องกัน ใช้แถบกั้นรอบหลุม
20. คนอยู่ในหลุมไม่ใส่หมวก  วิธีป้องกัน สวมหมวกเซฟตี้
21. ไม่มีคนเฝ้าปากหลุม  วิธีป้องกัน ต้องมีผู้ดูแล
22. เครื่องมือวางรอบหลุม  วิธีป้องกัน เก็บเครื่องมือให้เรียบร้อย
เครื่องมือและการใช้ค้อน (ซ้ายล่าง)
23. คนตอกตะปูไม่ใส่ถุงมือ  วิธีป้องกัน ใส่ถุงมือกันบาด
24. ใช้มือจับตะปูโดยตรง  วิธีป้องกัน ใช้คีมจับแทน
25. ตอกใกล้ขอบไม้ วิธีป้องกัน  เลื่อนเข้ามาด้านใน
26. ไม่ใส่แว่นตานิรภัย  วิธีป้องกัน ใส่แว่นตาเซฟตี้

เครื่องจักรกลึง (ล่างขวา)
27. เครื่องจักรไม่มีที่ครอบ  วิธีป้องกัน ติดตั้งที่ครอบ
28. ผู้ปฏิบัติงานไม่ใส่แว่นตา  วิธีป้องกัน ต้องใส่ทุกครั้ง
29. ผมยาวไม่มัด  วิธีป้องกัน มัดหรือใส่หมวกคลุมผม','https://res.cloudinary.com/ddvmr1z07/image/upload/v1757067587/safety-spot/wtn4iy67j98mqfmrchgu.jpg','pending',0,'2025-09-05 17:19:48.286+07'),
	 ('SUBab260b70-fc62-4f37-9cf9-1e2776458cb0','ACT1756717423151','U54ecd6a77c2c8805e6a64d8fec358aff','-ยกของและเคลื่อนย้ายหนักและจำนวนมาก
-ของอาจล้มใส่คนยกหรือตกใส่เพื่อนทำให้ใดรับบาดเจ็บหัวแตกแขนขาฟกช้ำ
-แก้ไขโดยใช้รถยกหรือรถเข็น',NULL,'pending',0,'2025-09-05 17:43:24.385+07'),
	 ('SUB4a553b06-3c7d-4163-b405-7ca1c216c1be','ACT1756717423151','U5ed5f1ea35304e72d2785df3c705470a','ฝาปิดพื้นยกขึ้นมาแล้วไม่วางให้พ้น จุดอันตราย หรือทำสัญลักษณ์บอกว่าอันตราย
จุดเสี่ยงอาจทำให้คนเดินมาสะดุดเกิดอุบัติเหตุได้','https://res.cloudinary.com/ddvmr1z07/image/upload/v1757081496/safety-spot/a9syli7r6ndoua9q6rcu.jpg','pending',0,'2025-09-05 21:11:37.889+07'),
	 ('SUB22d117a1-e83c-482f-b102-cfc1ca0c4a6e','ACT1756717423151','U9385e759d7c6eb3f001317f8d640fdad','จุดเสี่ยง
1.คนยืนบนกล่องซ้อนกันเพื่อเช็ดหน้าต่างเสี่ยงต่อการล้มวิธีป้องกัน ใช้บันได
2.น้ำหยดลงพื้นทำให้พื้นลื่นวิธีป้องกันทำให้พื้นแห้งอยู่เสมอ
3.คนยกตู้เซฟหนักด้วยตัวเองเสี่ยงบาดเจ็บกล้ามเนื้อวิธีป้องกันให้หาอุปกรณ์ยก
4.เครนแขวนตู้เซฟอยู่เหนือศีรษะคนอันตรายมากวิธีป้องกันให้ติดตั้งกับพื้น
5.คนกำลังแบกขอสูงเกินศีรษะวิธีป้องกันใช้วิธียกให้ถูกต้อง
6.คุณกำลังปีนวางกล่องซ้อนสูงกล่องไม่มั่นคงอาจล้มทับได้วิธีแก้ไขห้ามวางของเกินความสูงเกินกำหนด
7.ทั้งกลิ้งบนพื้นเสี่ยงสะดุดล้มวิธีแก้ไขวางของให้ถูกต้องวางถูกที่
8.พื้นมีช่องโหว่เสียงคนตกลงไปวิธีแก้ให้หาอุปกรณ์มาปิดให้มิดชิด
9.ใช้ค้อนใกล้คนอื่นมากอาจพลาดโดนเพื่อนร่วมงานได้วิธีแก้ไขให้ห่างจากจากเพื่อนร่วมงาน
10.คนดันของหนักเพียงลำพังวิธีแก้ไขให้หาอุปกรณ์ช่วย
11.บันไดวางขวางพื้นที่ทำงานวิธีแก้ไขให้เก็บอุปกรณ์ให้เต็มที่เป็นระเบียบเรียบร้อย
12.ผู้หญิงกำลังใช้เหล็กตัดไม่มีอุปกรณ์ปิดบังใบหน้าวิธีแก้ไขให้ใช้อุปกรณ์เซฟตี้ปิดบังใบหน้า
13.อุปกรณ์การทำงานแต่ละชิ้นวางละเกรกกะวิธีแก้ไขหาที่เก็บอุปกรณ์ให้เป็นระเบียบเรียบร้อย
14.ยกของหนักไม่ถูกวิธีวิธีแก้ไขให้ยกของหนักตามมาตรฐานการยกของ
15.พนักงานไม่สวมอุปกรณ์เซฟตี้วิธีแก้ไขให้พนักงานทุกคนสวมอุปกรณ์เซฟตี้ขณะทำงาน
16.ยกของหนักควรใส่bellเพื่อป้องกันการปวดหลัง',NULL,'pending',0,'2025-09-05 17:50:49.136+07');
INSERT INTO public.submissions ("submissionId","activityId","lineUserId",description,"imageUrl",status,points,"createdAt") VALUES
	 ('SUBd6d03fef-47be-497f-973b-bd85db0c3e7c','ACT1756717423151','U3f08e5c27ff57004358e74657c179dfb','😀การทำงานบนที่สูง/ปีนป่าย                            1. ปีนกล่องแทนบันได วิธีป้องกันใช้บันไดมาตรฐาน
2. กล่องไม่มั่นคง วิธีป้องกันห้ามใช้กล่องเป็นฐานปีน
3. ไม่มีคนช่วยประคองบันได วิธีป้องกัน ให้ผู้ช่วยจับบันได
4. เช็ดกระจกโดยไม่คาดเข็มขัดนิรภัย วิธีป้องกัน ใช้สายรัดเซฟตี้
5. บันไดวางบนพื้นลื่น วิธีป้องกัน วางบันไดบนพื้นแห้ง มียางกันลื่น
6. บันไดพาดเอียงเกินไป วิธีป้องกันปรับองศา 75°
7. ไม่สวมรองเท้ากันลื่นตอนปีน วิธีป้องกัน ใส่รองเท้าเซฟตี้พื้นกันลื่น
😀ของเหลว / น้ำมันหก
8. น้ำมันหกบนพื้น วิธีป้องกัน เช็ดทันที
9. ไม่มีป้ายเตือนพื้นลื่น วิธีป้องกัน ติดป้ายเตือน
10. คนเดินบนพื้นเปียก วิธีป้องกันใส่รองเท้ากันลื่น
11. ถังน้ำมันล้มกลิ้ง วิธีป้องกันเก็บถังในชั้น/ที่ล็อก
12. ถังไม่มีฝาปิด วิธีป้องกัน ใช้ฝาปิดแน่นหนา                         13. สารเคมีไม่มีป้ายบ่งบอก วิธีป้องกันติดฉลากชัดเจน
14. เก็บสารเคมีใกล้แหล่งไฟ วิธีป้องกัน แยกโซนจัดเก็บ
15. ไม่มีถาดรองรับถังรั่ว วิธีป้องกันใช้ถาดรองน้ำมัน
😀 การยกและเคลื่อนย้ายของหนัก

16. แบกตู้เซฟคนเดียว วิธีป้องกัน ใช้รถเข็น/รถยก
17. ยกผิดท่า วิธีป้องกัน ฝึกวิธียกถูกต้อง
18. แบกของหนักเกินกำลัง วิธีป้องกันยก 2 คนช่วยกัน
19. ใช้เส้นทางเดินแคบ วิธีป้องกัน เคลียร์ทางเดินให้กว้าง
20. ของหนักวางบนที่สูง วิธีป้องกัน วางในระดับเอว–อก
21. ไม่มีถุงมือเวลาแบก วิธีป้องกัน ใส่ถุงมือป้องกันบาดมือ
😀 การจัดเก็บกล่อง/วัสดุ
22. กล่องซ้อนสูงเกินไป วิธีป้องกัน จำกัดความสูงไม่เกินอก
23. กล่องซ้อนไม่มั่นคง วิธีป้องกัน จัดเรียงสลับฟันปลา
24. ไม่มีรั้วกั้นกองกล่อง วิธีป้องกัน ใช้เชือกกั้น
25. คนเดินผ่านกองสูง วิธีป้องกันห้ามเข้าใกล้
26. กล่องไม่มีฉลาก วิธีป้องกันติดฉลากบอกน้ำหนัก/ด้านบน-ล่าง
27. ทางเดินมีของกีดขวาง วิธีป้องกัน เคลียร์พื้นที่โล่ง
😀 หลุมเปิดในพื้น
28. พื้นเปิดไม่มีฝาปิดวิธีป้องกัน ใช้ฝาปิดแข็งแรง
29. ไม่มีป้ายเตือน วิธีป้องกัน ติดป้าย “ระวังตกหลุม”
30. ไม่มีรั้วกั้นรอบหลุม วิธีป้องกัน ใช้แถบกั้น
31. คนในหลุมไม่ใส่หมวก วิธีป้องกัน ใส่หมวกเซฟตี้
32. ไม่มีคนเฝ้าปากหลุม วิธีป้องกัน ต้องมีผู้ดูแล
33. คนทำงานในหลุมไม่มีหน้ากาก วิธีป้องกัน สวมหน้ากากกันฝุ่น/สารเคมี
34. ไม่มีไฟส่องสว่างในหลุม วิธีป้องกัน ติดตั้งไฟพกพา
35. เครื่องมือวางรอบปากหลุม วิธีป้องกัน เก็บในกล่อง
😀 เครื่องมือช่าง / การตอกตะปู
36. ตอกตะปูไม่ใส่ถุงมือ วิธีป้องกันใส่ถุงมือ
37. ใช้มือจับตะปูตรงๆ วิธีป้องกัน ใช้คีมจับ
38. ตอกใกล้ขอบไม้ วิธีป้องกันเลื่อนตำแหน่ง
39. ไม่ใส่แว่นตา วิธีป้องกัน ใส่แว่นตาเซฟตี้
40. ใช้ค้อนแตก/ด้ามหลวม วิธีป้องกัน ใช้ค้อนมาตรฐาน
41. เครื่องมือวางเกลื่อนพื้น วิธีป้องกัน เก็บเข้ากล่อง
42. ไม่มีจุดจัดเก็บเครื่องมือ วิธีป้องกัน จัดทำบอร์ด/ตู้เก็บ
😀 เครื่องจักรกลึง/เครื่องจักรอื่นๆ
43. ไม่มีที่ครอบเครื่องจักร วิธีป้องกัน ติดตั้งครอบป้องกัน
44. ไม่ใส่แว่นตา วิธีป้องกัน ใส่แว่นเซฟตี้
45. ผมยาวไม่มัด วิธีป้องกัน มัดผม/ใส่หมวกคลุม
46. เสื้อผ้าหลวม วิธีป้องกัน ใส่ชุดทำงานรัดกุม
47. ไม่มีปุ่มหยุดฉุกเฉิน วิธีป้องกัน ติดตั้ง E-stop
48. ไม่มีการอบรมใช้งานเครื่อง วิธีป้องกัน ฝึกอบรมก่อนใช้งาน
49. ไม่ทำความสะอาดเศษโลหะ วิธีป้องกัน เก็บเศษทันที
50. ไม่สวมที่อุดหูเมื่อเครื่องดัง วิธีป้องกันใส่ที่อุดหู','https://res.cloudinary.com/ddvmr1z07/image/upload/v1757069952/safety-spot/zudugr7xh0mcrfls4qfp.jpg','pending',0,'2025-09-05 17:59:13.451+07'),
	 ('SUBbb6b6e0f-5dac-4a05-af8d-cd94ee142208','ACT1756717423151','U5ed5f1ea35304e72d2785df3c705470a','ยกของหนักโดยไม่มีอุปกรณ์ช่วยเซฟ
จุดเสี่ยงอาจทำให้ขอหลุดร่วงของเสียหายและอาจอาการปวดหลังได้','https://res.cloudinary.com/ddvmr1z07/image/upload/v1757073387/safety-spot/ukss7b4tmsgebyojfm4a.jpg','pending',0,'2025-09-05 18:56:28.267+07'),
	 ('SUBdf1370f7-45fd-475f-9b9d-db5b5573b597','ACT1756717423151','U5ed5f1ea35304e72d2785df3c705470a','ฝนตกแล้วมีพนักงานเปียกฝนยืนอยู่ข้างพนักงานที่กำลังยืนบนกล่อง
จุดเสี่ยงพนักงานที่เปียกฝนอาจจะลื่นไปชนกล่องของพนักงานที่ยืนอยู่บนกล่องทำให้เกิดอุบัติเหตุได้','https://res.cloudinary.com/ddvmr1z07/image/upload/v1757073673/safety-spot/ex276cfq0hqrqllvrtpg.jpg','pending',0,'2025-09-05 19:01:14.162+07'),
	 ('SUBa46f3355-c584-4018-8d86-8104525c80b6','ACT1756717423151','U5ed5f1ea35304e72d2785df3c705470a','ใช้เครื่องจักรโดยไม่มีอุปกรณ์ป้องกันอันตรายและไม่สวมใส่ถุงมือป้องกันขณะปฏิบัติงาน
จุดเสี่ยงอาททำให้เคื่องมือทับมือเพราะไม่มีเครื่องมือปัองกันอันตราย','https://res.cloudinary.com/ddvmr1z07/image/upload/v1757074125/safety-spot/p0i5tp14xypm2uvchynp.jpg','pending',0,'2025-09-05 19:08:46.544+07'),
	 ('SUB9f755b69-77dc-41d1-925a-7bb32a78537d','ACT1756717423151','U5ed5f1ea35304e72d2785df3c705470a','ถังน้ำมันหก
จุดเสี่ยงคืออาจทำให้คนที่เดินมาไม่เห็นลื่นล้มเกิดอันตรายได้','https://res.cloudinary.com/ddvmr1z07/image/upload/v1757074247/safety-spot/blp4pcq4muxkaxq8munj.jpg','pending',0,'2025-09-05 19:10:48.599+07'),
	 ('SUBf62922bf-bc26-4f0f-8882-43739541a7a3','ACT1756717423151','U5ed5f1ea35304e72d2785df3c705470a','ยกกล่องหนักเกินกำลัง
จุดเสี่ยงอาจปวดหลังหรือขอร่วงใส่พื้นเสียหายได้','https://res.cloudinary.com/ddvmr1z07/image/upload/v1757074490/safety-spot/cx2smhq15kirb8hhm0uk.jpg','pending',0,'2025-09-05 19:14:51.376+07'),
	 ('SUB53d8ea88-f93f-4cb4-a196-30958c3bee80','ACT1756717423151','U5ed5f1ea35304e72d2785df3c705470a','ใช้มือจับเครื่องมือที่กำลังปฏิบัติงานอยู่โดยไม่มีอุปกรณ์ป้องกันกันอันตราย
จุดเสี่ยงอาจเกิดอันตรายเครื่องตัดมือได้','https://res.cloudinary.com/ddvmr1z07/image/upload/v1757076367/safety-spot/vcvliyeyrquzy0axthw1.jpg','pending',0,'2025-09-05 19:46:08.927+07'),
	 ('SUB02ff286c-0266-4a96-a3af-861d8629d317','ACT1756717423151','U5ed5f1ea35304e72d2785df3c705470a','ใช้เครืีองจักรโดยไม่มีอุปกรณ์ป้องกันอันดับรายไม่ใสุถุงมือขณะปฏิบัติงานไม่สวมใส่หมวดขณะปฏิบัติงาน
จุดเสียงอาททำให้เกิดอุบัติเหตุกับมือ หรือเครื่องมืออาจดึงฝมเข้าเครื่องได้','https://res.cloudinary.com/ddvmr1z07/image/upload/v1757076682/safety-spot/rk52u6kgjaurmyrtwmjl.jpg','pending',0,'2025-09-05 19:51:24.404+07'),
	 ('SUBc5c4be45-464a-4633-92bd-e8d0246032e1','ACT1756717423151','U5ed5f1ea35304e72d2785df3c705470a','เปิดฝาซ่อมงานโดยไม่มีกรวยวางตรงจุดอันตรายหรือ มีอุปกรณ์เซฟตี้เพื่อป้องกันอันตรายจากการปฎิบัติงาน
จุดเสี่ยงอาจทำให้จุดเสี่ยงอาจทำให้คนที่เดินผ่านไปผ่านมามาสะดุดอุปกรณ์ซ่อมงานทำให้ตกลงไปในหลุมที่กำลังซ่อมงานทั้งคนปฏิบัติงานและคนเดินผ่านโดยไม่รู้ตัว และผู้ปฏิบัติงานไม่ได้ใส่สวมใส่เซฟตี้ในการปฏิบัติงาน อาจทำให้ อาจทำให้ผู้ปฏิบัติงานลงไปในหลุมได้','https://res.cloudinary.com/ddvmr1z07/image/upload/v1757077072/safety-spot/fnsuv1rdckr3ijtvvf8z.jpg','pending',0,'2025-09-05 19:57:53.72+07'),
	 ('SUBa57a01aa-f70f-461c-923a-6c7c08a7a00c','ACT1756717423151','U5ed5f1ea35304e72d2785df3c705470a','วางกล่องไว้บนโต๊ะทำงานหรือวางไม่ถูกที่ไม่มีป้ายชีบ่งลักงานที่วางบนโต๊ะ
จุดเสี่ยงกล่องอาจตกลงมาเกิดอุบัติเหตุได้','https://res.cloudinary.com/ddvmr1z07/image/upload/v1757081180/safety-spot/mbuimy12ulpimvwqodx4.jpg','pending',0,'2025-09-05 21:06:21.376+07');
INSERT INTO public.submissions ("submissionId","activityId","lineUserId",description,"imageUrl",status,points,"createdAt") VALUES
	 ('SUB1b2b0ee2-d950-458a-ad01-311ec520bcde','ACT1756717423151','U5ed5f1ea35304e72d2785df3c705470a','บรรไดวางไม่ถูกที่
จุดเสี่ยง อาจเกิดอุบัติเหตุได้','https://res.cloudinary.com/ddvmr1z07/image/upload/v1757081292/safety-spot/nye4ydjimmnjqjbnjtol.jpg','pending',0,'2025-09-05 21:08:13.463+07'),
	 ('SUB466001d6-c06c-460e-ae31-9273b26fd450','ACT1756717423151','U5ed5f1ea35304e72d2785df3c705470a','กล่องวางเทิร์นกันหลายชั้นเกินไป
จุดเสี่ยงทำให้ยกงานลำบากอาจเกิดอุบัติเหตุปวดหลังหรือว่างานหลุดร่วงได้','https://res.cloudinary.com/ddvmr1z07/image/upload/v1757081691/safety-spot/fi7vb3go46telpr9lnfz.jpg','pending',0,'2025-09-05 21:14:52.404+07'),
	 ('SUB802f0543-cba7-4b25-bf6a-700a1f54141a','ACT1756717423151','U5ed5f1ea35304e72d2785df3c705470a','อุปกรณ์การทำงานวางไม่ถูกที่
จุดเสี่ยงอาจมีคนเดินมาสะดุดล้มได้รับบาดเจ็บ','https://res.cloudinary.com/ddvmr1z07/image/upload/v1757081884/safety-spot/gfemdaywbwexqhrqbvcm.jpg','pending',0,'2025-09-05 21:18:05.495+07'),
	 ('SUBe7acc318-2d28-4ab5-bc3e-05dd3492de70','ACT1756717423151','Ue977dea7d3c75347dc63b6bd88368dec','ยกของหนักเกิน',NULL,'pending',0,'2025-09-05 21:49:08.458+07'),
	 ('SUBafe686bd-0905-4ff2-89da-a53b34faf553','ACT1756717423151','U463d6c75321700740b8093575d6aaaf3','1.เด็กเข้ามาบริเวณที่ทำงานที่มีเครื่องจักรอาจเกิดอันตราย ไม่ควรให้เด็กเข้าในพื้นที่
2.ถังที่บรรจุของเหลวหกคว่ำทำให้พื้นเปียกอาจทำให้ลื่นล้มได้ ควรมีฝาปิดถัง และเช็ดพื้นให้แห้ง','https://res.cloudinary.com/ddvmr1z07/image/upload/v1757087258/safety-spot/fstwmyfz4w67uqgblith.jpg','pending',0,'2025-09-05 22:47:39.312+07'),
	 ('SUBf4161ae1-c34a-4833-bce7-f62f09a99335','ACT1756717423151','U410bb259434247e428bffe17a4c7886e','1. ยืนบนกล่องเพื่อซ่อมหน้าต่าง
ใช้บันไดหรือ Scaffolding ที่แข็งแรงแทน
2. พื้นมีน้ำ/ของเหลวหก เช็ดทำความสะอาดทันที และติดป้าย “พื้นลื่น”
3. ยกตู้เซฟหนักด้วยแรงคน ใช้รถยก  และเทคนิคยกของที่ถูกต้อง
4. เข็นของบนพื้นเปียก ตรวจสอบพื้นก่อนเคลื่อนย้าย และใส่รองเท้านิรภัยกันลื่น
5. ถือกล่องบังสายตา ใช้รถเข็นแทน หรือวางในท่าที่มองเห็นทางเดิน
6. กองกล่องสูงไม่มั่นคง จัดเรียงให้สูงไม่เกินมาตรฐาน และใช้ชั้นวางที่แข็งแรง
7. บันไดวางเกะกะบนพื้น เก็บบันไดเข้าที่หลังใช้งาน
8. พื้นมีรู/ฝาเปิด ทำรั้วกั้นพร้อมติดป้ายเตือน
9. ใช้ค้อนตอกไม้โดยไม่ใส่แว่นตา ใส่แว่นตานิรภัย และทำงานให้ห่างจากผู้อื่น
10. ใช้เครื่องจักรมีประกายไฟโดยไม่ใส่แว่นตา
ใส่แว่นตานิรภัย, ถุงมือ และชุดป้องกัน
11. เครื่องจักรไม่มีฝาครอบ (Machine Guard)
ติดตั้งฝาครอบและตรวจสอบสภาพสม่ำเสมอ
12. ตะขอเครนห้อยอยู่ด้านบน ยกตะขอขึ้นเก็บให้สูงพ้นศีรษะ และกั้นพื้นที่ทำงานเครน
13. ไม้กระดานวางพาดไว้บนโต๊ะ จัดเก็บไม้อย่างเรียบร้อย ไม่วางพาดเสี่ยงหล่น
14. อุปกรณ์ช่างวางเกะกะ (ประแจ/ค้อน)
เก็บเข้ากล่องเครื่องมือหลังใช้งาน
15. ท่าทางการทำงานผิด (เช่น ดันกล่องก้มตัวผิดท่า) อบรมการยก/ดันของตามหลัก
16. ไม่มีเขตกั้นพื้นที่อันตราย สีพื้นแบ่งเขตงาน
17. ไม่มีใครใส่อุปกรณ์ PPE (หมวกนิรภัย/ถุงมือ/รองเท้าเซฟตี้) บังคับใช้ PPE ตามมาตรฐานอาชีวอนามัย
18. หน้าต่างกระจกมีรอยแตก ซ่อมหรือเปลี่ยนทันที และห้ามจับกระจกแตกด้วยมือเปล่า
19. ถังน้ำมัน/ของเหลวหกโดยไม่ปิดฝา
ปิดฝาภาชนะให้แน่น 
20. คนยืนใกล้ผู้ยกของหนัก (ตู้เซฟ)
เว้นระยะห่าง ไม่ยืนในทิศทางที่ของอาจตกใส่
21. ผมยาวไม่ถูกรวบ ขณะใช้เครื่องจักร
มัดหรือรวบผม และใส่หมวกนิรภัยก่อนทำงานกับเครื่องจักรเ
22. ไม่มีถุงมือในการยกของ/ใช้เครื่องมือ
ใส่ถุงมือที่เหมาะกับงาน เช่น ถุงมือกันบาด, ถุงมือกันไฟ
23. วัสดุไวไฟวางใกล้จุดเชื่อมเหล็ก/ประกายไฟ
24. คนสวมรองเท้าไม่เหมาะสม ป้องกันดารลื่นล้ม ไม่มีถุงมือในการยกของ ควรใส่ถุง
25.มีเด็กอยู่ในพื้นที่ทำงาน กำหนดอายุผู้ทำงาน
26.คนเดินผ่านเขตเครนยกของ กั้นเขตทำงานของเครน และติดป้ายเตือน “ห้ามผ่าน”
27.ไม่มีบรรไดหนีไฟ ตรวจสอบเส้นทางหนีไฟ
28.เสียงดังจากเครื่องจักร ใช้อุปกรณ์ลดเสียงที่ครอบหู ปลั๊กอุดหู
29.ไม่มีป้ายเสียงการใช้อุปกรณ์หรือเครื่องจักร ติดป้ายแนะนำการใช้อุปกรณ์และขั้นตอนการใช้
30.ไม่มีถังดับเพลิงใกล้จุดที่เกิดประกายไฟ
จัดวางถังดับเพลิงในตำแหน่งที่เข้าถึงง่าย และตรวจสอบสภาพถังสม่ำเสมอ
31.แสงสว่างในบางพื้นที่ไม่เพียงพอ
ติดตั้งไฟส่องสว่างให้ทั่วถึง โดยเฉพาะพื้นที่ทำงานที่เสี่ยง
32.ชั้นวางของไม่ได้ยึดติดกับผนังยึดชั้นวางให้แน่นหนา ป้องกันการล้ม
33.คนทำงานในที่สูงโดยไม่มีเข็มขัดนิรภัย
ใช้อุปกรณ์ป้องกันการตก (Safety Harness) และติดตั้งราวกันตก
34.คนสวมรองเท้าไม่เหมาะสม ใช้รองเท้านิรภัย (Safety Shoes) ที่กันลื่นและหัวเหล็ก
35.พนักงานไม่สวมหมวกนิรภัย จัดหานิรภัยให้พนักงานที่ทำงานที่เสี่ยงที่สูงสวมใส่',NULL,'pending',0,'2025-09-06 00:10:10.942+07'),
	 ('SUBd12bc5b0-6ffc-4f1d-9ff0-fec4d11e507f','ACT1756717423151','Uc3deb58f23a35214bef4304af0f4ce31','1. ผู้ชายยืนบนกล่องปิดหน้าต่างตอนฝนตก กล่องไม่มั่นคงอาจทำให้ตกได้รับอันตราย ควรหาวัสดุที่มั่นคงแข็งแรงหรือบันไดมา
2. ผู้ชาย เดินแบบกล่อง ในลักษณะที่ไม่ถูกต้องอาจทำให้ได้รับอันตราย ควรยกให้ถูก วิธี เพื่อป้องกันอันตราย','https://res.cloudinary.com/ddvmr1z07/image/upload/v1757116091/safety-spot/qxgxj64jlwgnuhgxw0gj.jpg','pending',0,'2025-09-06 06:48:11.825+07'),
	 ('SUB2c465e20-be4c-44b9-9f61-79ba7a335f19','ACT1756717423151','Uedf90f9b5212577262c7d4b266e6bd2b','-มีคนยืนบนกล่อง',NULL,'pending',0,'2025-09-06 11:48:53.313+07'),
	 ('SUB2c950d21-85c6-4278-b2ce-d3fd9e3e8b7d','ACT1756717423151','Uedf90f9b5212577262c7d4b266e6bd2b','อันตรายที่อาจเกิดขึ้น
1. มีพนักงานยืนบนกล่องเพื่อเช็ดกระจก อาจพลัดตกลงมาได้
2.พนักงานยกตู้เซฟขนาดใหญ่ อาจหล่นลงมาทับตัว หรือแขนขาได้รับอันตรายได้
3.พนักงานยกกล่องเทินบนศรีษะ อาจเดินชนสิ่งกีดขวางด้านบน แล้วหล่นใส่ตัวพนักงานได้
4.บนพื้น มีน้ำ หรือคราบน้ำมัน อาจลื่นล้มขณะ
ปฏิบัติงานได้
5.มีท่อนไม้ หรือ วัสดุวางเกะกะ ในบริเวณพื้นที่ปฏิบัติงาน อาจทำให้พนักงานเดินสะดุดล้มเกิดอันตราย ต่อบุคคลได้
6.ทำงานกับเครื่องจักรไม่มีอุปกรณ์ ป้องกันอันตราย อาจถูกเครื่องจักรหนีบ หรือดึงส่วนใดส่วนหนึ่งเข้าไป 
7.มีการใช้เครนในขณะปฏิบัติงาน อาจมีสิ่งของล่วงหล่น มาใส่พนักงานที่ทำงานอยู่ด้านล่าง
8.พนักดันของที่สูงกว่าตัว อาจเกิดล้มทับตัวพนักงานได้
9.พนักงานใช้ค้อนในการปฎิบัติงาน  อาจหลุดมือ หรือกระแทกถูกนิ้วได้
10.พนักงานก้มลงในช่องที่เปิดบนพื้น อาจมีคนเดินมาสะดุด หรือตกลงไปด้านล่างได้
วิธีการแก้ไขและป้องกัน
จัดเก็บของให้เป็นระเบียบ ควรจัดเก็บอุปกรณ์ให้เป็นที่เป็นทาง ไม่วางเกะกะบนทางเดิน โดยเฉพาะท่อนไม้ หรือวัสดุที่อาจทำให้เกิดการสะดุดได้
ทำความสะอาดพื้นที่ทำงาน หากมีของเหลวหรือน้ำ หก อยู่ควรรีบทำความสะอาด ทันที หรือก่อนการปฏิบัติงานทุกครั้ง เพื่อป้องกันการลื่นล้ม
การยกของหนัก ควรใช้อุปกรณ์ในการช่วยยก เช่น รถเข็น หรือรถยก แทนแรงงานคน และต้องรู้วิธีการยกที่ถูกวิธีด้วย
ทำงานที่สูงควรใช้บันใดที่มั่นคง และแข็งแรง และมีความสูงที่เหมาะสมกับสภาพงานนั้นๆๆ
ควรมีการฝึกอบรมการใช้เครื่องมือ เครื่องจักร อย่างถูกต้องและปลอดภัย และผู้ปฏิบัติงานต้องแต่งกายให้เหมาะสม รัดกุม
สวมใส่อุปกรณ์ ppe ควรมีการสวมใส่หมวกนิรภัย เื่อป้องกันสิ่งของหล่นใส่ สวมถุงมือเพื่อป้องกันการบาดเจ็บจากเครื่องมือ และรองเท้า safety
ควรมีป้ายเตือนพื้นที่อันตราย เช่น ระวังพื้นลื่น
ระวังสิ่งของตก','https://res.cloudinary.com/ddvmr1z07/image/upload/v1757142919/safety-spot/sphhlofgxl74efoayrvd.jpg','pending',0,'2025-09-06 14:15:20.04+07'),
	 ('SUBb01ab325-4542-4744-ab17-8e91b45aff7c','ACT1756717423151','Ua6166688603926b5ecb49f220e1d3cb7','อันตรายในภาพและแนวทางแก้ไข

1.คนยืนบนกล่องเพื่อซ่อมหน้าต่าง

อันตราย: กล่องไม่มั่นคง เสี่ยงลื่นหรือล้ม

ผลที่อาจเกิดขึ้น: หกล้ม บาดเจ็บ ศีรษะกระแทก

วิธีป้องกัน: ใช้บันไดที่ได้มาตรฐานและมั่นคงแทน

2.น้ำมันหกบนพื้น มีคนเดินผ่าน

อันตราย: พื้นลื่น

ผลที่อาจเกิดขึ้น: ลื่นล้ม กระดูกหัก

วิธีป้องกัน: เช็ดทำความสะอาดทันที และติดป้ายเตือนพื้นเปียก

3.คนกำลังยกตู้เซฟหนัก ๆ ด้วยตัวเอง

อันตราย: ใช้แรงผิดท่าและน้ำหนักเกินกำลัง

ผลที่อาจเกิดขึ้น: ปวดหลัง กล้ามเนื้อฉีก

วิธีป้องกัน: ใช้เครน รถโฟล์คลิฟท์ หรือทำงานเป็นทีม

4.ถังน้ำมัน/สารเคมีหก

อันตราย: พื้นลื่น และอาจติดไฟหรือมีสารเคมีเป็นพิษ

ผลที่อาจเกิดขึ้น: ไฟไหม้ แผลไหม้ สูดดมสารพิษ

วิธีป้องกัน: จัดเก็บสารเคมีให้เหมาะสม มีถาดรองรับ และทำความสะอาดด้วยอุปกรณ์ที่ถูกต้อง

5.กล่องวางสูง ไม่มั่นคง / มีคนยกกล่องโดยใช้หัวรองรับ

อันตราย: กล่องหล่นใส่ศีรษะ

ผลที่อาจเกิดขึ้น: บาดเจ็บที่ศีรษะ คอ หรือหลัง

วิธีป้องกัน: จัดเรียงของอย่างปลอดภัย ใช้อุปกรณ์ยกหรือบันไดที่เหมาะสม สวมหมวกนิรภัย

6.ฝาท่อ/พื้นเปิด มีคนตกลงไป

อันตราย: ไม่มีฝาปิดหรือป้ายเตือน

ผลที่อาจเกิดขึ้น: ตกลงไป กระดูกหัก ศีรษะกระแทก

วิธีป้องกัน: ปิดฝาให้แน่น ติดป้ายเตือน และกั้นพื้นที่อันตราย

7.คนใช้เครื่องจักร (เครื่องกลึง) โดยไม่ใส่อุปกรณ์ป้องกัน

อันตราย: เส้นผมหรือเสื้อผ้าพันเข้าเครื่อง

ผลที่อาจเกิดขึ้น: แขน/มือบาดเจ็บรุนแรง

วิธีป้องกัน: สวม PPE ที่เหมาะสม (แว่นตา ถุงมือพิเศษ เสื้อแขนสั้น/รัดแขน) และใช้ที่ครอบป้องกันเครื่องจักร

8.บันไดวางบนพื้น แต่ไม่ได้เก็บเข้าที่

อันตราย: คนอาจสะดุดล้ม

ผลที่อาจเกิดขึ้น: หกล้ม บาดเจ็บ

วิธีป้องกัน: จัดเก็บบันไดเข้าที่เมื่อไม่ใช้งาน

9.คนใช้ค้อนโดยไม่ใส่แว่นตานิรภัย

อันตราย: เศษโลหะหรือไม้กระเด็นเข้าตา

ผลที่อาจเกิดขึ้น: ตาบาดเจ็บ ตาบอด

วิธีป้องกัน: สวมแว่นตานิรภัย และใช้ค้อนที่เหมาะสม','https://res.cloudinary.com/ddvmr1z07/image/upload/v1757152988/safety-spot/tusojkbv4xafjtq0xdtu.jpg','pending',0,'2025-09-06 17:03:09.136+07');
INSERT INTO public.submissions ("submissionId","activityId","lineUserId",description,"imageUrl",status,points,"createdAt") VALUES
	 ('SUB2a742471-fe50-438e-857a-7467344515f4','ACT1756717423151','Ue99cdc80e70df5465c4a91cc4aae4196','1. ผู้ชายยืนบนกล่องปิดหน้าต่างตอนฝนตก กล่องอาจทำให้ตกได้รับอันตราย ควรหาวัสดุที่มั่นคงแข็งแรงหรือบันไดมา','https://res.cloudinary.com/ddvmr1z07/image/upload/v1757168763/safety-spot/jiwzmhkhpojbz4eodbl6.jpg','pending',0,'2025-09-06 21:26:03.972+07'),
	 ('SUB97ed631c-042e-4926-8b15-62c94abd3d65','ACT1756717423151','U518990f3753ab23beb7e49b82e53e77f','1.ยกของที่มีน้ำหนักเกิด
2.พื้นมีน้ำขังเกิดจากการรั่วซึม
3.ขึ้นยืนบนกล่องที่ไม่มั่นคง
4.พื้นที่ทำงานไม่เป็นระเบียบ
5.ทำงานในเครื่องจักรไม่มีการ์ดบังและไม่สวมใส่อุปกร์ป้องกันอุบัติเหตุ
6.วัสดุอุปกรณ์ต่างๆไม่เก็บให้เป็นระเบียบ','https://res.cloudinary.com/ddvmr1z07/image/upload/v1757172331/safety-spot/fsrdnirlohybbftmfe8t.jpg','pending',0,'2025-09-06 22:25:32.194+07'),
	 ('SUBf801834d-4ca9-4622-a10c-997633ebab56','ACT1756717423151','Ue977dea7d3c75347dc63b6bd88368dec','ยกของหนักเกิน
ไม่ควรยกของที่หนักเกินกำลังของเราควรใช้เครนยกของหนักมายกแทนเพื่อป้องกันการเกิดอุบัติเหตุกับต้วเรา','https://res.cloudinary.com/ddvmr1z07/image/upload/v1757206724/safety-spot/ob7oxrq8kiky6soba1mo.jpg','pending',0,'2025-09-07 07:58:45.057+07'),
	 ('SUBaa9520ee-ec6a-4c24-828d-8504640725a7','ACT1756717423151','Ufb9e106fa98bb35ade0accad707044e3','อันตรายจากภาพ
1...ยกของหนักเกินกำลัง = ควรใช้อุปกรณ์ในการช่วยยกเช่นรถยกหรือรถเข็นงานเพื่อป้องกันอันตราย
2..การทำงานในที่สูงไม่ควรใช้กล่องมาลอง
      = ควรใช้บันไดจะได้มีความปลอดภัย
3...การเคลื่อนย้ายสิ่งของไม่ควรลากหรือยกไว้บนศีรษะ
      = ควรใช้รถลากหรือรถเข็นงานในการเคลื่อนย้าย
4...การทำงานกับเครื่องจักร 
     = ควรมีอุปกรณ์ป้องกันในการทำงานเช่นถุงมือหน้ากากหรือแว่นตาเพื่อป้องกันอันตราย
5...ถังน้ำที่ หกบนพื้นอาจทำให้ลื่นล้มได้
 =  ควรมีฝาปิดถังน้ำเพื่อป้องกันไม่ให้น้ำหกและเก็บให้เป็นระเบียบมากขึ้น
6...ทุกพื้นที่ดูไม่มีความปลอดภัยเลยเพราะการวางสิ่งของที่ไม่เป็นระเบียบการทำงานที่ไม่มีความปลอดภัยทั้งตัวเองและเพื่อนร่วมงาน
 =  ควรวางสิ่งของให้เป็นระเบียบมากขึ้นและใส่ใจในความปลอดภัยของตัวเองและเพื่อนร่วมงาน','https://res.cloudinary.com/ddvmr1z07/image/upload/v1757229691/safety-spot/kyfmgadwgx8cclsmzdz5.jpg','pending',0,'2025-09-07 14:21:32.458+07'),
	 ('SUB3cfd6c98-6bf0-4993-9805-bd8b1c15cbfb','ACT1756717423151','U566d021df9589e746b2cf0cac397ceba','1 ขึ้นที่สูงไม่ควรเอากล่องวางเรียงกันอาจเกิดอุบัติเหตุได้ ควรเอาบันไดมาใช้ในการขึ้นที่สูง
2 ทำงานกับเครื่องจักรควรใส่อุปกรณ์เซฟตี้
3 ยกของหนักอาจทำให้ปวดหลังได้ คนใช้รถเข็นในการย้ายของ
4 หน้าต่างฝนตกน้ำฝนสาดเข้ามาทำให้ของเปียกควรปิดหน้าต่าง
5 เปิดฝาท่อแล้ววางไว้โดยไม่มีที่กั้นอาจทำให้เกิดอุบัติเหตุเดินตกท่อหรือสะดุดฝาท่อได้ ควรมีป้ายบอกหรือเอาเชือกมากัน
6 พื้นมีน้ำหกเปียกอาจทำให้เกิดอุบัติเหตุได้
7 ทุกพื้นที่อาจทำให้เกิดอุบัติเหตุได้ตลอดเวลา ควรจัดวางของให้เป็นระเบียบ เพื่อลดอุบัติเหตุในพื้นที่การทำงาน','https://res.cloudinary.com/ddvmr1z07/image/upload/v1757239255/safety-spot/lhqt6mez6lmnuweycktn.jpg','pending',0,'2025-09-07 17:00:55.812+07'),
	 ('SUB49ab38a8-0bfc-446b-ad79-65df5960f20d','ACT1756717423151','U3dd88218198a95b733087bc1362e9844','1.การกระทำที่ไม่ปลอดภัยที่อาจนำไปสู่อุบัติเหตุ
2.การทำงานโดยไม่มีอุปกรณ์เซฟตี้
3.การจัดเก็บสิ่งของไม่เป็นที่
4.การใช้เครื่องจักรที่ไม่มีอุปกรณ์ป้องกัน
3.การหยอกล้อหรือเล่นในขณะทำงาน
5.การไม่แจ้งเหตุการณ์หรืออุบัติเหตุที่เกิดขึ้น','https://res.cloudinary.com/ddvmr1z07/image/upload/v1757248606/safety-spot/twpjv9om69iejsiwxcaf.jpg','pending',0,'2025-09-07 19:36:47.858+07'),
	 ('SUBcc819b7c-c2e4-4cf4-a536-e9fda344a235','ACT1756717423151','U463d6c75321700740b8093575d6aaaf3','1.เครนที่แขวนอยู่ อาจโดนศรีษะผู้อื่น ควรมีที่กั้นหรือป้ายเตือนระวังอันตราย
2.มีชายทำงาน รูพื้นเปิดอยู่อาจจะตกหรือทำให้บุคคลอื่นตกลงไปได้ ควรมีอุปกรณ์ป้องกันและทำสัญลักษณ์เพื่อเตือนระวังอันตราย','https://res.cloudinary.com/ddvmr1z07/image/upload/v1757259941/safety-spot/bp7iqgf18bcds9s9xd3l.jpg','pending',0,'2025-09-07 22:45:41.84+07'),
	 ('SUBb6e891c5-a3a4-43c1-8c0a-733e29c94a0b','ACT1756717423151','U9385e759d7c6eb3f001317f8d640fdad','อุปกรณ์การทำงานวางไม่ถูกที่จุดเสี่ยงอาจมีคนเดินสะดุดล้มได้',NULL,'pending',0,'2025-09-08 08:48:34.218+07'),
	 ('SUB1a8afafe-6603-4fd1-826a-ffa49abf0f28','ACT1756717423151','U9385e759d7c6eb3f001317f8d640fdad','ฝาปิดพื้นยกขึ้นมาวางพื้นแล้วไม่ได้บอกจุดอันตรายไม่ได้ทำสัญลักษณ์บอกอาจเกิดอุบัติเหตุได้',NULL,'pending',0,'2025-09-08 08:49:35.681+07'),
	 ('SUB8cb42db1-1865-4e53-b2e3-ec25fb8eb5ef','ACT1756717423151','U9385e759d7c6eb3f001317f8d640fdad','มีคนกำลังเปลี่ยนกล่องขึ้นไปเช็ดกระจกแล้วมีอีกคนอยู่ข้างล่างอาจตกลงมาทับคนข้างล่างเกิดอุบัติเหตุทับกันได้',NULL,'pending',0,'2025-09-08 09:29:30.792+07');
INSERT INTO public.submissions ("submissionId","activityId","lineUserId",description,"imageUrl",status,points,"createdAt") VALUES
	 ('SUBee38a96b-2915-42a0-b3d9-0062d4040590','ACT1756717423151','U9385e759d7c6eb3f001317f8d640fdad','ถังน้ำที่หก อาจทำให้เกิดอันตรายคนอื่นเดินมาลื่นล้มได้ควรจัดการทำสัญลักษณ์อุบัติเหตุไว้',NULL,'pending',0,'2025-09-08 09:32:42.031+07'),
	 ('SUB2ecdc295-ca96-47d3-9f83-698d87e5894f','ACT1756717423151','U9385e759d7c6eb3f001317f8d640fdad','ห้องทำงานควรทำให้มิดชิดไม่ควรให้สงสารเข้ามาอาจทำให้อุปกรณ์บางอย่างโดนฝนแล้วเกิดอุบัติเหตุได้ค่ะ',NULL,'pending',0,'2025-09-08 09:33:51.035+07'),
	 ('SUB1c5f4c32-1473-4979-8d16-d62d23795b50','ACT1756717423151','U9385e759d7c6eb3f001317f8d640fdad','เครนที่แขวนอยู่ต้องทำให้สูงกว่าคนอาจจะเดินชนได้หรือทำป้ายอันตรายติดไว้ด้วย',NULL,'pending',0,'2025-09-08 10:09:56.219+07');
